test/artillery/concert-reservation/concert-reservation-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 1
      arrivalRate: 10000
  defaults:
    headers:
      Content-Type: "application/json"
  payload:
    path: "../userId.csv"
    fields:
      - userId
    order: sequential

scenarios:
  - flow:
      - post:
          url: "/concert/reservation"
          json:
            seatId: 1
            userId: "{{ userId }}"